---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace
source: html/1a8ac2d3-038e-55ad-a21a-80f5ff6aa9a6.htm
---
# EnergyAnalysisSpace Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.